# Data Structures

# Pandas Series

In [1]:
import pandas as pd

In [2]:
pd.Series( [42, 43, 44] )

0    42
1    43
2    44
dtype: int64

In [3]:
pd.Series( [42, 43, 44], dtype='f8' )

0    42.0
1    43.0
2    44.0
dtype: float64

In [5]:
pd.Series( [42, 43, 44] , index=['electron','proton','neutron'])

electron    42
proton      43
neutron     44
dtype: int64

In [6]:
s = pd.Series( [42, 43, 44] , index=['electron','proton','neutron'])
s

electron    42
proton      43
neutron     44
dtype: int64

In [7]:
s['electron']

42

In [8]:
s['electron':'proton']

electron    42
proton      43
dtype: int64

In [10]:
t = pd.Series({'electron':6, 
               'neutron':28,
               'proton':496,
               'neutrino':8128
              })
t

electron       6
neutrino    8128
neutron       28
proton       496
dtype: int64

In [11]:
s + t

electron     48.0
neutrino      NaN
neutron      72.0
proton      539.0
dtype: float64

In [12]:
df = pd.DataFrame({'S':s, 'T':t})
df

             S     T
electron  42.0     6
neutrino   NaN  8128
neutron   44.0    28
proton    43.0   496

In [16]:
df[:2]

             S     T
electron  42.0     6
neutrino   NaN  8128

In [15]:
df[::2]

             S   T
electron  42.0   6
neutron   44.0  28

In [18]:
df_temp = pd.DataFrame({'S': [-8128]}, index=['antineutrino'] )
df_temp

                 S
antineutrino -8128

In [19]:
dg = df.append(df_temp)
dg

                   S       T
electron        42.0     6.0
neutrino         NaN  8128.0
neutron         44.0    28.0
proton          43.0   496.0
antineutrino -8128.0     NaN

In [21]:
dg = df.append(pd.DataFrame({'S': [-8128]}, index=['antineutrino'] ))
dg

                   S       T
electron        42.0     6.0
neutrino         NaN  8128.0
neutron         44.0    28.0
proton          43.0   496.0
antineutrino -8128.0     NaN

In [22]:
dh = dg.drop('neutron')
dh

                   S       T
electron        42.0     6.0
neutrino         NaN  8128.0
proton          43.0   496.0
antineutrino -8128.0     NaN

In [23]:
df.T

   electron  neutrino  neutron  proton
S      42.0       NaN     44.0    43.0
T       6.0    8128.0     28.0   496.0

In [27]:
df.transpose()

   electron  neutrino  neutron  proton
S      42.0       NaN     44.0    43.0
T       6.0    8128.0     28.0   496.0

In [28]:
df < 42

              S      T
electron  False   True
neutrino  False  False
neutron   False   True
proton    False  False

In [30]:
df['T']

electron       6
neutrino    8128
neutron       28
proton       496
Name: T, dtype: int64

In [31]:
type(df['T'])

pandas.core.series.Series

In [32]:
df['T']<42

electron     True
neutrino    False
neutron      True
proton      False
Name: T, dtype: bool

In [33]:
df[df['T']<42]

             S   T
electron  42.0   6
neutron   44.0  28

In [35]:
df["S"][df['T']<42]

electron    42.0
neutron     44.0
Name: S, dtype: float64

In [39]:
df['Value'] = df['T']<42
df

             S     T  small  Value
electron  42.0     6   True   True
neutrino   NaN  8128  False  False
neutron   44.0    28   True   True
proton    43.0   496  False  False